; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	infrared5 - mode
	thermograph2 - mode
	thermograph3 - mode
	infrared6 - mode
	spectrograph0 - mode
	thermograph4 - mode
	thermograph1 - mode
	Star4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared6)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared6)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument7 infrared5)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 infrared5)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(pointing satellite3 GroundStation3)
	(have_image Phenomenon5 infrared5)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 thermograph3)
	(have_image Star8 infrared5)
	(have_image Star9 spectrograph0)
))

)

; plan
1. (turn_to satellite3 groundstation1 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 7
2. (turn_to satellite1 groundstation0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 7
4. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 1 of 7
5. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 7
6. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 7
7. (calibrate satellite3 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 1 of 7
8. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 1 of 7
9. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 1 of 7
10. (turn_to satellite1 phenomenon7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 7
11. (take_image satellite1 phenomenon7 instrument3 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 2 of 7
12. (turn_to satellite1 planet6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet6)
   goals met: 2 of 7
13. (take_image satellite1 planet6 instrument3 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 3 of 7
14. (turn_to satellite2 star9 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star9)
   goals met: 3 of 7
15. (take_image satellite2 star9 instrument5 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 4 of 7
16. (turn_to satellite3 phenomenon5 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon5)
   goals met: 4 of 7
17. (take_image satellite3 phenomenon5 instrument7 infrared5)
   added: (have_image phenomenon5 infrared5)
   goals met: 5 of 7
18. (turn_to satellite3 star8 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 star8)
   goals met: 5 of 7
19. (take_image satellite3 star8 instrument7 infrared5)
   added: (have_image star8 infrared5)
   goals met: 6 of 7
20. (turn_to satellite3 groundstation3 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 groundstation3)
   goals met: 7 of 7
